[
    {
        "id":1,
        "title": "Capitals Of The World App" ,
        "image":"https://i.ibb.co/RHkLybm/quizgameforsite.png",
        "intro": "This was my first ever frontend app - Its a quiz game based on the capital cities of the world. I brought in all the data from a third party API. The app features every capital city in the world and the player has a choice of 4 answers with one being correct for each question. Each correct answer receives10 points and the user must get to 100 points before getting 5 questions wrong. ",
      "technologies":"I used vanilla JavaScript, HTML and CSS to develop this App."
    },
    {
        "id":2,
        "title": "Know Your Wizard" ,
        "image":"https://i.ibb.co/CnNrmf1/knowyourwizardforsite.png",
        "intro": "This app was developed while I was attending a immersive software developer bootcamp by General Assembly. Initially I had planned to do an app where the user would be able to search local breweries but after getting in touch with the developer who had put together the API for the data and was informed that the API was suffering from issues - developer had reason to believe that someone had an infinite loop running. I had always been a fan of the Harry Potter world and after research I found the API was very stable I decided to develop 'Know Your Wizard' - an app for fans of Harry Potter or non fans to learn about each character of the Harry Potter World",
      "technologies":"I used React for the framework to develop this App and React Bootstrap for the styling. I also used Axios to bring in the data from the third party API and React Router for rendering multiple pages."
    },
    {
        "id":3,
        "title": "Fleet App" ,
        "image":"https://i.ibb.co/RY4M2mN/fleetforsite.png",
        "intro": "This was a group developed app with myself and 3 other developers. The app is for business owners or members of the public with multiple vehicles, by using the app they will be able to keep track of such things as mileage, if the vehicles needs maintenance etc. The app has authentication built into it so each account has different data.",
      "technologies":"We used many technologies including Node, Express, Mongoose, React, React-Bootstrap"
    },
     {
        "id":4,
        "title": "FetchGoal App" ,
        "image":"https://i.ibb.co/7z5dh1B/fetchgoalforsite.png",
        "intro": "This app was made as a passion of made...'football' it was also my capstone project for my software immersive bootcamp. It was originally a paired developed app with another developer from my bootcamp. We split into frontend and backend with myself in charge of the frontend. I have since completed the backend myself to add experience and knowledge to my backend portfolio.",
      "technologies":"The backend was built using Django and Python. The frontend I used React , React Bootstrap and SASS."
    },
     {
        "id":5,
        "title": "Pop Up Picnics Site" ,
        "image":"https://i.ibb.co/k3xQ707/picnicforsite.png" ,
        "intro": "This Website was built for a local Events company who had to change the way they did business due to COVID-19. Its a branch off from their main site and is promoting a new business that offers social distancing picnics. I planned the site from start to finish and produced all contents myself, including photography..",
      "technologies":"React and React Bootstrap."
    },
    {
        "id":6,
        "title": "Events Company Site" ,
        "image":"https://i.ibb.co/k3xQ707/picnicforsite.png",
        "intro": "This Website was built for a local Events company who had to change the way they did business due to COVID-19. Its a branch off from their main site and is promoting a new business that offers social distancing picnics. I planned the site from start to finish and produced all contents myself, including photography..",
      "technologies":"Wordpress, Google forms and Dubsado"
    }

]